#include <conio.h>
#include <iostream>

using namespace std;
int menu()
{    
	cout << "******************************************************\n"
		<< "*      1.矩阵加法      2.矩阵数乘      3.矩阵转置    *\n"
		<< "*      4.矩阵乘法      5.Hadamard乘积  6.矩阵卷积    *\n"
		<< "*      7.卷积应用      8.OTSU 算法     9.其他加分项  *\n"
		<< "*      A.your picture  0.退出系统                    *\n"
		<< "******************************************************\n"
		<< "7、8、9：点击图片，按下空格可关闭所有图片\n"
		<< "A：点击视频，按下空格可选择视频画面进行变换\n"
		<< "选择菜单项<0~A> :";
	char choise = _getch();
	return choise;
}


